Revit 2027 API
ViewCropRegionShapeManager.IsCropRegionShapeValid Method
 Verifies that boundary represents one closed curve loop without self-intersections, consisting of non-zero length straight lines in a plane parallel to the view plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCropRegionShapeValid(
	CurveLoop boundary
)
Public Function IsCropRegionShapeValid (
	boundary As CurveLoop
) As Boolean
public:
bool IsCropRegionShapeValid(
	CurveLoop^ boundary
)
member IsCropRegionShapeValid :
        boundary : CurveLoop -> bool
Parameters
boundary CurveLoop
 The crop boundary.
Return Value
Boolean
 True if the passed crop boundary represents one closed curve loop without self-intersections, consisting of non-zero length straight lines in a plane parallel to the view plane.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Curves in boundary use model coordinates.
See Also
Reference
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace